In [4]:
!pip install pandas

==]0;Collecting pandas
  Downloading pandas-2.2.2-cp312-cp312-macosx_11_0_arm64.whl.metadata (19 kB)
Collecting numpy>=1.26.0 (from pandas)
  Downloading numpy-1.26.4-cp312-cp312-macosx_11_0_arm64.whl.metadata (61 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 61.1/61.1 kB 4.3 MB/s eta 0:00:00
Requirement already satisfied: python-dateutil>=2.8.2 in ./.venv/lib/python3.12/site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Downloading pytz-2024.1-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Downloading tzdata-2024.1-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in ./.venv/lib/python3.12/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Downloading pandas-2.2.2-cp312-cp312-macosx_11_0_arm64.whl (11.3 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 11.3/11.3 MB 14.4 MB/s eta 0:00:00m eta 0:00:01[36m0:00:01
Downloading numpy-1.26.4-cp312-cp312-macosx_11_0_arm64.whl (13.7 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 13.7/13.7 MB 11.0 MB/s eta 0:00:00[36m0:00:01m eta 0:00:01
Downloading pytz-2024.1-py2.py3-none-any.whl (505 kB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 505.5/505.5 kB 16.1 MB/s eta 0:00:00
Downloading tzdata-2024.1-py2.py3-none-any.whl (345 kB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 345.4/345.4 kB 21.0 MB/s eta 0:00:00
Installing collected packages: pytz, tzdata, numpy, pandas
Successfully installed numpy-1.26.4 pandas-2.2.2 pytz-2024.1 tzdata-2024.1
=]0;

In [6]:
import pandas as pd

In [7]:
file_path = './example_data.csv'
data = pd.read_csv(file_path)

In [8]:
data.head()

   ID    Name  Age    Country  Salary
0   1  Name_1   21  Country_2   30100
1   2  Name_2   22  Country_3   30200
2   3  Name_3   23  Country_4   30300
3   4  Name_4   24  Country_5   30400
4   5  Name_5   25  Country_1   30500

In [9]:
modified_data = data.copy()
modified_data['Salary'] = modified_data['Salary'] * 1.1  # Increase salary by 10%

In [10]:
output_file_path = './modified_example_data.csv'
modified_data.to_csv(output_file_path, index=False)

In [11]:
new_data = pd.read_csv(output_file_path)
new_data.head()

   ID    Name  Age    Country   Salary
0   1  Name_1   21  Country_2  33110.0
1   2  Name_2   22  Country_3  33220.0
2   3  Name_3   23  Country_4  33330.0
3   4  Name_4   24  Country_5  33440.0
4   5  Name_5   25  Country_1  33550.0